# MassDataConceptualConstruction Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MassDataConceptualConstruction Property
ParameterTypeId Class See Also
---
"Conceptual Types"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MassDataConceptualConstruction { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MassDataConceptualConstruction As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MassDataConceptualConstruction {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace